# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nhoizey/cask'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
brew 'dnsmasq', restart_service: true
brew 'openssh'
brew 'openssl'
brew 'openvpn'
brew 'rsync'
brew 'wget'
cask 'controlplane'
cask 'protonvpn'
cask 'transmission'

# Terminal
brew 'autojump'
brew 'joe'
brew 'starship'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
cask 'iterm2'

# Améliorations d'interface et usage
brew 'glance-chamburr'
cask 'barrier'
cask 'raycast'
cask 'setapp'
cask 'swiftdefaultappsprefpane'
mas 'Amphetamine', id: 937984704

# Utilitaires divers
brew 'duti'
cask '1password'
cask 'deepl'
cask 'grandperspective'
cask 'screenflow9'
cask 'yemuzip'

# Backup et synchro
brew 'mackup'
cask 'backblaze'
cask 'carbon-copy-cloner'
cask 'google-drive-file-stream'
cask 'synology-drive'

# Web
cask 'firefox'
cask 'google-chrome'

# Développement
brew 'git'
brew 'node'
brew 'pkg-config'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'github'
cask 'meld'
cask 'polypane'
cask 'reflector'
cask 'visual-studio-code'

# Images
cask 'imageoptim'

# Vidéos
brew 'ffmpeg'
brew 'yt-dlp'
cask 'catch'
cask 'handbrake'
cask 'subler'
cask 'subsmarine'
cask 'vlc'

# Photo
cask 'adobe-creative-cloud'

# Divertissement
# cask 'steam'

# Communication
cask 'signal'
cask 'whatsapp'
# mas 'LimeChat', id: 414030210
mas 'Slack', id: 803453959
mas 'Tweetbot 3', id: 1384080005

# Bureautique et productivité
# cask 'libreoffice'
cask 'macdown'
cask 'netnewswire'
cask 'obsidian'

# Misc
cask 'yacreader'
