# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nhoizey/cask'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
brew 'wget'  
brew 'dnsmasq', restart_service: true
brew 'openssh'
brew 'openssl'
brew 'openvpn'
brew 'bitwarden'
brew 'rsync'
brew 'wget'

brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'iterm2'
cask 'jetbrains-toolbox'

# Web
cask 'firefox'
cask 'google-chrome'

# Développement
brew 'git'
brew 'node'
cask 'visual-studio-code'

# Vidéos
brew 'ffmpeg'
cask 'handbrake'
cask 'vlc'

# Photo
cask 'adobe-creative-cloud'
cask 'docker'

# Divertissement
cask 'steam'

# Communication
cask 'signal'
cask 'whatsapp'